app/controllers/posts_controller.rb

INSERT INTO "posts" ("title", "body", "photo_file_name", "photo_content_type", "photo_file_size", "photo_updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["title", "titre"], ["body", "oui"], ["photo_file_name", "Desert.jpg"], ["photo_content_type", "image/jpeg"], ["photo_file_size", 845941], ["photo_updated_at", "2020-03-17 07:49:10.212928"]]
---
  def create
    @post = Post.new(post_params)

    respond_to do |format|
      if @post.save

UPDATE "posts" SET "body" = ? WHERE "posts"."id" = ?  [["body", "Les toilettes sont particulièrement propres et sentent bon!"], ["id", 7]]
---
  def update
    respond_to do |format|
      if @post.update(post_params)