app/controllers/users_controller.rb

  def create
    @user = User.new(user_params)

    respond_to do |format|
      if @user.save
---
INSERT INTO "users" ("name", "email", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["name", "Bastien"], ["email", "bastien.ratat@gmail.com"], ["created_at", "2020-03-17 09:52:39.318936"], ["updated_at", "2020-03-17 09:52:39.318936"]]

  def update
    respond_to do |format|
      if @user.update(user_params)
---
UPDATE "users" SET "avatar_file_name" = ?, "avatar_content_type" = ?, "avatar_file_size" = ?, "avatar_updated_at" = ?, "password_digest" = ?, "updated_at" = ? WHERE "users"."id" = ?